src/cf/InformationRegisters/ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/КлассыУсловийТрудаПоРезультатамСпециальнойОценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КлассыУсловийТрудаПоРезультатамСпециальнойОценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Опасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Допустимый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптимальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда();
	
КонецПроцедуры

Процедура ЗаполнитьТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		// Не добавляем записи, если регистр уже заполнен (из-за создания начального образа РИБ или АРМ, например).
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда.СоздатьНаборЗаписей();	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1;
	Запись.Тариф = 2;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2;
	Запись.Тариф = 4;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3;
	Запись.Тариф = 6;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4;
	Запись.Тариф = 7;
	Запись = НаборЗаписей.Добавить();
	Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный;
	Запись.Тариф = 8;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
